jch12138/nrf52840_rtt/packages/nrf5x_sdk-latest/rtt_adapter/ble_app_uart.c
/*
 * Copyright (c) 2006-2020, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2020-07-23     supperthomas first version
 *
 */

#include <rtthread.h>
#include <rtdevice.h>
#include <drivers/serial.h>

#include "sdk_config.h"
#include "nordic_common.h"
#include "nrf_soc.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "ble_advdata.h"
#include "app_error.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_nus.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "ble_conn_params.h"
#include "ble_advertising.h"
#include "ipc/ringbuffer.h"

#define DBG_SECTION_NAME "BLE"
#define DBG_COLOR
#define DBG_LEVEL DBG_LOG
#include <rtdbg.h>


#include <dfs_posix.h>


#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define DEVICE_NAME                     "Pluse"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                18000                                       /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */



//#define NRF_LOG_ERROR(...)                     rt_kprintf(__VA_ARGS__)
//#define NRF_LOG_WARNING(...)                   rt_kprintf( __VA_ARGS__)
//#define NRF_LOG_INFO(...)                      rt_kprintf( __VA_ARGS__)
//#define NRF_LOG_DEBUG(...)                     rt_kprintf( __VA_ARGS__)

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static struct rt_ringbuffer ringbuffer_handler;
static rt_uint8_t ringbuffer[1024] = {0};
static rt_device_t serial;
#define UART_NAME       "uart0"      /* 串口设备名称 */

extern rt_uint32_t result1,result2,result3;//ADC采样值
extern rt_adc_device_t adc_dev;
rt_uint8_t  result[6];

int fd,size;
char file_name[20] = "0000000000000.hex"; 	//记录数据的文件名
char time_stamp[14]= "0000000000000"; 					    //采样开始时的时间戳

static struct rt_ringbuffer ringbuffer_putc_handler;
static rt_uint8_t ringbuffer_putc[1024] = {0};
static rt_thread_t savedate = NULL;
static rt_thread_t sendfile = NULL;
static rt_timer_t update;

/**@brief Function for saveadcvalue.
 *

 */
static void save_date(void *param)
{
        result1 = rt_adc_read(adc_dev, 5);
        result2 = rt_adc_read(adc_dev, 6);
        result3 = rt_adc_read(adc_dev, 7);
        rt_kprintf("%d %d %d \r\n",result1,result2,result3);
        result[0] = (result1>>8)&0xff;
        result[1] =  result1&0xff;
        result[2] = (result2>>8)&0xff;
        result[3] =  result2&0xff;
        result[4] = (result3>>8)&0xff;
        result[5] =  result3&0xff;
        rt_kprintf("%d %d %d %d %d %d \r\n",result[0],result[1],result[2],result[3],result[4],result[5]);
        write(fd,result,6);
        rt_kprintf("writesuccesss\r\n");

}
/**@brief Function for transfor adcvalue history.
 *
 */
static void rsdate(void *param)
{
        char *buffer;
        read(fd,buffer,6)
        uint16_t len = 6;
        ble_nus_data_send(&m_nus, buffer,&len , m_conn_handle);
}
static void send_file_test(void *param)
{
        while(1){
        result[0] = 0x01;
        result[1] = 0x02;
        result[2] = 0x03;
        result[3] = 0x04;
        result[4] = 0x05;
        result[5] = 0x06;
        uint16_t len = 6;
        ble_nus_data_send(&m_nus, result,&len , m_conn_handle);
        rt_thread_mdelay(20);
        }
}
static void read_fname(void *param)
{
    DIR *dirp;
    struct dirent *dp;
    /* 打开根目录 */
    rt_kprintf("the directory is:\n");
    dirp = opendir("/");
    for (dp = readdir(dirp); dp != RT_NULL; dp = readdir(dirp))
    {          
        rt_kprintf("%s\n", dp->d_name);
    }
}
MSH_CMD_EXPORT(read_fname, readfilename)
/**@brief Function for transforadcvalue ontime.
 *
 */
static void timeout(void *param)
{
    result1 = rt_adc_read(adc_dev, 5);
//        rt_kprintf("saadc channel 0 value = %d, ",result); 
    result2 = rt_adc_read(adc_dev, 6);
//       rt_kprintf("saadc channel 1 value = %d \n",result);
    result3 = rt_adc_read(adc_dev, 7);
//        rt_kprintf("saadc channel 5 value = %d",result);  
    result[0] = (result1>>8)&0xff;
    result[1] =  result1&0xff;
    result[2] = (result2>>8)&0xff;
    result[3] =  result2&0xff;
    result[4] = (result3>>8)&0xff;
    result[5] =  result3&0xff;
	rt_kprintf("data: %d, %d, %d \n",result1,result2,result3);
    uint16_t len = 6;
    ble_nus_data_send(&m_nus, result,&len , m_conn_handle);
}
/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 *
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
         //   err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

