jch12138/nrf52840_rtt/packages/nrf5x_sdk-latest/rtt_adapter/ble_app_uart.c
    }
    int32_t timestop=rt_tick_get();
    close(fd);
    rt_kprintf("usetime = %d\r\n",timestop-timestart);

}
MSH_CMD_EXPORT(savetest, test adc save to file);
int readtest()
{   int size;
    char buffer[40];
    fd=  open("\hello.hex", O_RDONLY);
    size = read(fd, buffer, sizeof(buffer));
    for(int i=0;i<=30;i++)
    {
        rt_kprintf("%d ",buffer[i]);
    }
    rt_kprintf(" \r\nsize=%d",size);
}
MSH_CMD_EXPORT(readtest, test adc read to file);
int stop_save(void)
{

}
MSH_CMD_EXPORT(stop_save, stop_save save adcvalue);

int ble_uart_send(int argc, char **argv)
{
    char buffer[256];
    uint16_t length; 
    char text[15] = "ble uart test\n";

    if(argc==1)
    {
        length = rt_strlen(text);
        ble_nus_data_send(&m_nus, text, &length, m_conn_handle);
    }


    if(argc==2)
    {
        length = rt_strlen(argv[1]);
        rt_strncpy(buffer, argv[1], length);
        ble_nus_data_send(&m_nus, buffer, &length, m_conn_handle);
    }



    return 0;
}
MSH_CMD_EXPORT(ble_uart_send, ble uart test)

// int ble_app_uart(void)
// {
//     rt_ringbuffer_init(&ringbuffer_handler, ringbuffer, sizeof(ringbuffer));
//     rt_ringbuffer_init(&ringbuffer_putc_handler, ringbuffer_putc, sizeof(ringbuffer_putc));
//     serial = rt_device_find(UART_NAME);
//     if (!serial)
//     {
//         rt_kprintf("find %s failed!\n", UART_NAME);
//         return -RT_ERROR;
//     }
    
//     static rt_thread_t tid1 = RT_NULL;

//     tid1 = rt_thread_create("softdevice",
//                         ble_app_softdevice, RT_NULL,
//                         4096,
//                         22, 5);
//     if (tid1 != RT_NULL)
//         rt_thread_startup(tid1);

//     tid1 = rt_thread_create("serial_task",
//                         uart_task, RT_NULL,
//                         1024,
//                         22, 5);
//     if (tid1 != RT_NULL)
//     {
//         rt_thread_startup(tid1);
//     }
//     return RT_EOK;
// }
// MSH_CMD_EXPORT(ble_app_uart, ble app uart);
